In [46]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

def ck(m1, m2, t1, t2, tf):
    Cp = 4.184
    dT = lambda t, tf: tf - t
    return(-(m1 * Cp * dT(t1, tf) + m2 * Cp * dT(t2, tf))/dT(t1, tf))

def dH(m_h2o, m_naoh, Ck, t1, tf):
    Mr = 39.997
    Cp = 4.184
    dT = tf - t1
    m = m_h2o + m_naoh
    return -(m * Cp * dT + Ck * dT) * Mr / m_naoh / 1000

In [11]:
# CONSTANZA ACETO

83.75670666666663

In [63]:
# TOMÁS DE ARTECHE
datos = pd.read_excel('tp_termo_dearteche.xlsx')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
display(Ck)

deltaH = dH(datos['m2'], datos['m1'], 29, datos['T1'], datos['T2'])
display(deltaH)

      Exp    T1    T2    Tf     m1     m2  RESULTADO
0     Ck1  45.5  23.8  35.0  48.02  49.00      17.77
1     Ck2  45.7  24.0  35.2  48.61  49.30      29.17
2     NaN   NaN   NaN   NaN    NaN    NaN        NaN
3     NaN   NaN   NaN   NaN    NaN    NaN        NaN
4  deltaH  24.3  29.4   NaN   1.00  99.95   88936.00
5  deltaH  24.3  29.4   NaN   1.00  99.95   91261.00

0    17.768053
1    16.638373
2          NaN
3          NaN
4          NaN
5          NaN
dtype: float64

0     7.861149
1     7.832223
2          NaN
3          NaN
4   -92.073553
5   -92.073553
dtype: float64

In [ ]:
# PABLO AVEDAÑO

In [ ]:
# VICENTE DELL'ORO SANSONI

In [ ]:
# GABIEL GONZÁLEZ

In [ ]:
# MATIAS NAHUEL GUERRERO

In [36]:
# TOMÁS LEUNDA
datos = pd.read_csv('LEUNDA_TP2.csv', index_col=0)
display(datos)

t1, t1b, t1c = 47.5, 50.3, 49.0
t2a, t2b, t2c = 23.0, 22.0, 22.5
m1a, m1b, m1c = 50.0, 49.8, 49.7
m2a, m2b, m2c = 50.0, 51.4, 51.4

result = ck(datos['M1 (gr)'], datos['M2 (gr)'], datos['T1 (°C)'], datos['T2 (°C)'], datos['TF (°C)'])
print(result)

deltaH = dH(datos['M1 (gr)'], datos['M2 (gr)'], 22, datos['T1 (°C)'], datos['T2 (°C)'])
print('DH')
print(deltaH)

             T1 (°C)  T2 (°C)  TF (°C)  M1 (gr)  M2 (gr)  resultado
Experiencia
ck1             47.5     23.0     37.5    50.00    50.00       94.1
ck2             50.3     22.0     38.3    49.80    51.40       83.4
ck3             49.0     22.5     36.2    49.70    51.40       22.2
deltaH          23.5     29.0      5.5    99.52     0.94      -78.5

Experiencia
ck1        94.140000
ck2        83.756707
ck3        22.234038
deltaH   -421.526378
dtype: float64
DH
Experiencia
ck1         8.631193
ck2         9.808921
ck3         9.176404
deltaH   -103.515024
dtype: float64

In [ ]:
# LUCÍA MESYNGIER

In [ ]:
# AGUSTINA PEQUE

In [45]:
# CAROLINA NICOLE SCHLAEN

datos = pd.read_excel('Schlaen_Datos_TpTermo.xlsx')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
print(Ck)

deltaH = dH(datos['msc'], datos['mNaOH'], (29.6+52.9)/2, datos['T1'], datos['Tf'])

print(deltaH)

  Unnamed: 0     T1    T2    Tf      m1      m2     msc  mNaOH  resultado
0       Ck 1  47.15  23.6  35.7  45.076  49.348     NaN    NaN     29.595
1       Ck 2  46.20  23.6  36.1  48.223  49.189     NaN    NaN     52.946
2    Delta H  22.90   NaN  27.8     NaN     NaN  99.509  1.011 -88709.000

0    29.595168
1    52.946324
2          NaN
dtype: float64
0          NaN
1          NaN
2   -89.526256
dtype: float64

In [52]:
# TOBÍAS VIOLA APREA
datos = pd.read_excel('tp_termo_Toby.xlsx')
display(datos)

Ck = ck(datos['m1 (g)'], datos['m2 (g)'], datos['T1 (C)'], datos['T2 (C)'], datos['Tf (C)'])
print(Ck)

deltaH = dH(datos['mHCl (g)'], datos['mNaOH (g)'], 20, datos['T1 (C)'], datos['Tf (C)'])
print(deltaH)

,Experiencia,T1 (C),T2 (C),Tf (C),m1 (g),m2 (g),mHCl (g),mNaOH (g),Resultado
0,Ck1,43.8,25.5,34.0,48.830,48.358,NaN,NaN,-28.786978
1,Ck2,43.5,25.5,34.9,48.872,49.092,NaN,NaN,20.008396
2,Ck3,44.3,22.7,34.0,49.729,49.712,NaN,NaN,20.103324
3,∆H1,24.0,NaN,28.6,NaN,NaN,100.136,1.0260,-78661.675077
4,∆H2,24.0,NaN,28.8,NaN,NaN,100.485,1.1625,-72684.702616

0   -28.814525
1    20.027543
2    20.122562
3          NaN
4          NaN
dtype: float64
0          NaN
1          NaN
2          NaN
3   -79.487384
4   -73.539674
dtype: float64

In [ ]:
# JULIÁN VILLA